scottstamp/darts/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# CPU Frequency Boost (240 MHz Max Performance)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Compiler Optimization (Optimize for Performance -O2)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Memory & PSRAM Configuration (Octal 80MHz DDR)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Flash Configuration (Quad I/O 80MHz)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS & System
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Enable LCD RGB panel driver
CONFIG_ESP_LCD_ENABLE_RGB_PANEL=y

# Enable LVGL Built-in Fonts for UI text & badges
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
